vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC5536_DFP.pdsc
    <condition id="driver.dc-fb-ssd1963.condition_id">
      <require condition="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.ssd1963, device=LPC5536.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.ssd1963, device=LPC5536.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ssd1963"/>
      <require condition="device.LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.dialog7212.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.da7212_adapter, driver.codec, device=LPC5536.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.da7212_adapter, driver.codec, device=LPC5536.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="da7212_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.display-adv7535.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=LPC5536.internal_condition"/>
    </condition>
    <condition id="allOf.driver.display-common, driver.video-i2c, device=LPC5536.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="video-i2c"/>
      <require condition="device.LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.display-common.condition_id">
      <require condition="allOf.driver.video-common, device=LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.display-it6161.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.display-it6263.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.display-sn65dsi83.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.dmic.condition_id">
      <require condition="allOf.driver.common, device_id=LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.dmic_dma.condition_id">
      <require condition="allOf.driver.lpc_dma, device=LPC5536.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpc_dma, device=LPC5536.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require condition="device.LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.dmic_hwvad.condition_id">
      <require condition="allOf.driver.dmic, device_id=LPC5536.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dmic, device_id=LPC5536.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmic"/>
      <require condition="device_id.LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.ektf2k.condition_id">
      <require condition="allOf.device=LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.enc.condition_id">
      <require condition="allOf.driver.common, device_id=LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm.condition_id">
      <require condition="allOf.driver.common, device_id=LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_i2c.condition_id">
      <require condition="allOf.driver.common, driver.flexcomm, device_id=LPC5536.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.flexcomm, device_id=LPC5536.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require condition="device_id.LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_i2c_dma.condition_id">
      <require condition="allOf.driver.lpc_dma, device=LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_i2s.condition_id">
      <require condition="allOf.driver.common, driver.flexcomm, device_id=LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_i2s_dma.condition_id">
      <require condition="allOf.driver.lpc_dma, device=LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_spi.condition_id">
      <require condition="allOf.driver.common, driver.flexcomm, device_id=LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_spi_dma.condition_id">
      <require condition="allOf.driver.lpc_dma, device=LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_usart.condition_id">
      <require condition="allOf.driver.flexcomm, device_id=LPC5536.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm, device_id=LPC5536.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require condition="device_id.LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_usart_dma.condition_id">
      <require condition="allOf.driver.lpc_dma, device=LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.flexspi.condition_id">
      <require condition="allOf.driver.common, device_id=LPC5536.internal_condition"/>
    </condition>
    <condition id="driver.flexspi_dma.condition_id">
      <require condition="allOf.driver.lpc_dma, device=LPC5536.internal_condition"/>
    </condition>
