vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC5536_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="psp27801" Cversion="1.0.0" condition="driver.psp27801.condition_id">
      <description>Driver psp27801</description>
      <files>
        <file category="header" name="components/display/psp27801/fsl_psp27801.h" projectpath="oled"/>
        <file category="sourceC" name="components/display/psp27801/fsl_psp27801.c" projectpath="oled"/>
        <file category="include" name="components/display/psp27801/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pwm" Cversion="2.9.0" condition="driver.pwm.condition_id">
      <description>PWM Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC5536/drivers/fsl_pwm.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC5536/drivers/fsl_pwm.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC5536/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="reset" Cversion="2.4.0" condition="driver.reset.condition_id">
      <description>Reset Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC5536/drivers/fsl_reset.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC5536/drivers/fsl_reset.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC5536/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="romapi" Cversion="2.0.0" condition="driver.romapi.condition_id">
      <description>ROMAPI Driver</description>
      <files>
        <file category="header" name="devices/LPC5536/drivers/romapi/flash/fsl_flash.h" projectpath="drivers/romapi/flash"/>
        <file category="include" name="devices/LPC5536/drivers/romapi/flash/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="romapi_flash" Cversion="2.0.0" condition="driver.romapi_flash.condition_id">
      <description>ROMAPI FLASHIAP Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC5536/drivers/romapi/flash/src/fsl_flash.c" projectpath="drivers/romapi/flash/src"/>
        <file category="header" name="devices/LPC5536/drivers/romapi/flash/fsl_efuse.h" projectpath="drivers/romapi/flash"/>
        <file category="header" name="devices/LPC5536/drivers/romapi/flash/fsl_flash_ffr.h" projectpath="drivers/romapi/flash"/>
        <file category="header" name="devices/LPC5536/drivers/romapi/flash/fsl_flash.h" projectpath="drivers/romapi/flash"/>
        <file category="header" name="devices/LPC5536/drivers/romapi/flash/fsl_flexspi_nor_flash.h" projectpath="drivers/romapi/flash"/>
        <file category="include" name="devices/LPC5536/drivers/romapi/flash/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="romapi_mem_interface" Cversion="2.0.0" condition="driver.romapi_mem_interface.condition_id">
      <description>ROMAPI MEM_INTERFACE Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC5536/drivers/romapi/mem_interface/src/fsl_mem_interface.c" projectpath="drivers/romapi/mem_interface/src"/>
        <file category="header" name="devices/LPC5536/drivers/romapi/mem_interface/fsl_mem_interface.h" projectpath="drivers/romapi/mem_interface"/>
        <file category="header" name="devices/LPC5536/drivers/romapi/mem_interface/fsl_sbloader_v3.h" projectpath="drivers/romapi/mem_interface"/>
        <file category="header" name="devices/LPC5536/drivers/romapi/mem_interface/fsl_sbloader.h" projectpath="drivers/romapi/mem_interface"/>
        <file category="include" name="devices/LPC5536/drivers/romapi/mem_interface/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="romapi_nboot" Cversion="2.0.0" condition="driver.romapi_nboot.condition_id">
      <description>ROMAPI NBOOT Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC5536/drivers/romapi/nboot/src/fsl_nboot.c" projectpath="drivers/romapi/nboot/src"/>
        <file category="header" name="devices/LPC5536/drivers/romapi/nboot/fsl_nboot_hal.h" projectpath="drivers/romapi/nboot"/>
        <file category="header" name="devices/LPC5536/drivers/romapi/nboot/fsl_nboot.h" projectpath="drivers/romapi/nboot"/>
        <file category="include" name="devices/LPC5536/drivers/romapi/nboot/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="romapi_runbootloader" Cversion="2.0.0" condition="driver.romapi_runbootloader.condition_id">
      <description>ROMAPI RUNBOOTLOADER Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC5536/drivers/romapi/runbootloader/src/fsl_runbootloader.c" projectpath="drivers/romapi/runbootloader/src"/>
        <file category="header" name="devices/LPC5536/drivers/romapi/runbootloader/fsl_runbootloader.h" projectpath="drivers/romapi/runbootloader"/>
        <file category="include" name="devices/LPC5536/drivers/romapi/runbootloader/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sctimer" Cversion="2.5.1" condition="driver.sctimer.condition_id">
      <description>SCT Driver</description>
      <files>
        <file category="header" name="devices/LPC5536/drivers/fsl_sctimer.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC5536/drivers/fsl_sctimer.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC5536/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl5000" Cversion="2.1.1" condition="driver.sgtl5000.condition_id">
      <description>Driver sgtl5000</description>
      <RTE_Components_h>
#ifndef CODEC_SGTL5000_ENABLE
#define CODEC_SGTL5000_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/sgtl5000/fsl_sgtl5000.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/sgtl5000/fsl_sgtl5000.c" projectpath="codec"/>
        <file category="include" name="components/codec/sgtl5000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ssd1963" Cversion="1.2.0" condition="driver.ssd1963.condition_id">
      <description>Driver ssd1963</description>
      <files>
        <file category="header" name="components/display/ssd1963/fsl_ssd1963.h" projectpath="lcdc"/>
        <file category="sourceC" name="components/display/ssd1963/fsl_ssd1963.c" projectpath="lcdc"/>
        <file category="include" name="components/display/ssd1963/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="st7796s" Cversion="1.0.0" condition="driver.st7796s.condition_id">
      <description>Driver st7796s</description>
      <files>
        <file category="header" name="components/display/st7796s/fsl_st7796s.h" projectpath="lcdc"/>
        <file category="sourceC" name="components/display/st7796s/fsl_st7796s.c" projectpath="lcdc"/>
        <file category="include" name="components/display/st7796s/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sysctl" Cversion="2.0.5" condition="driver.sysctl.condition_id">
      <description>SYSCTL Driver</description>
      <files>
        <file category="header" name="devices/LPC5536/drivers/fsl_sysctl.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC5536/drivers/fsl_sysctl.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC5536/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9896" Cversion="6.0.2" condition="driver.tfa9896.condition_id">
      <description>Driver tfa9896</description>
      <RTE_Components_h>
#ifndef CODEC_TFA9896_ENABLE
#define CODEC_TFA9896_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/tfa9896/fsl_tfa9896_buffer.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/tfa9896/fsl_hal_registers.c" projectpath="codec"/>
        <file category="sourceC" name="components/codec/tfa9896/fsl_tfa9896.c" projectpath="codec"/>
        <file category="header" name="components/codec/tfa9896/fsl_tfa9896.h" projectpath="codec"/>
        <file category="doc" name="components/codec/tfa9896/MIMXRT595595-EVK_TFA9896_SW.pdf" projectpath="codec"/>
        <file category="include" name="components/codec/tfa9896/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx" Cversion="2.1.0" condition="driver.tfa9xxx.condition_id">
      <description>Driver tfa9xxx</description>
      <RTE_Components_h>
#ifndef CODEC_TFA9XXX_ENABLE
#define CODEC_TFA9XXX_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/tfa9xxx/tfa_config_TFA9892N1.h" projectpath="codec/tfa9xxx"/>
        <file category="header" name="components/codec/tfa9xxx/tfa_config_TFA9894N1.h" projectpath="codec/tfa9xxx"/>
        <file category="header" name="components/codec/tfa9xxx/tfa_config_TFA9894N2.h" projectpath="codec/tfa9xxx"/>
        <file category="sourceC" name="components/codec/tfa9xxx/fsl_tfa9xxx.c" projectpath="codec/tfa9xxx"/>
        <file category="header" name="components/codec/tfa9xxx/fsl_tfa9xxx.h" projectpath="codec/tfa9xxx"/>
        <file category="sourceC" name="components/codec/tfa9xxx/fsl_tfa9xxx_IMX.c" projectpath="codec/tfa9xxx"/>
        <file category="doc" name="components/codec/tfa9xxx/README.md" projectpath="codec/tfa9xxx"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/config.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="sourceC" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_container.c" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_container.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="sourceC" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_dev.c" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_dev.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_dsp_fw.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="sourceC" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_haptic.c" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_haptic.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="sourceC" name="components/codec/tfa9xxx/vas_tfa_drv/tfa2_init.c" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/tfa9xxx_parameters.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="sourceC" name="components/codec/tfa9xxx/vas_tfa_drv/tfa_container_crc32.c" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="header" name="components/codec/tfa9xxx/vas_tfa_drv/tfa_haptic_fw_defs.h" projectpath="codec/tfa9xxx/vas_tfa_drv"/>
        <file category="include" name="components/codec/tfa9xxx/"/>
        <file category="include" name="components/codec/tfa9xxx/vas_tfa_drv/"/>
      </files>
    </component>
