vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC5536_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx_hal" Cversion="2.1.0" condition="driver.tfa9xxx_hal.condition_id">
      <description>Driver tfa9xxx_hal</description>
      <files>
        <file category="header" name="components/codec/tfa9xxx/tfa_device_hal.h" projectpath="codec/tfa9xxx"/>
        <file category="sourceC" name="components/codec/tfa9xxx/tfa_device_hal.c" projectpath="codec/tfa9xxx"/>
        <file category="include" name="components/codec/tfa9xxx/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tma525b" Cversion="1.0.0" condition="driver.tma525b.condition_id">
      <description>Driver tma525b</description>
      <files>
        <file category="header" name="components/touch/tma525b/fsl_tma525b.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/tma525b/fsl_tma525b.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/tma525b/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tsl2561" Cversion="1.0.0" condition="driver.tsl2561.condition_id">
      <description>Driver tsl2561</description>
      <files>
        <file category="header" name="components/sensor/tsl2561/fsl_tsl2561.h" projectpath="tsl"/>
        <file category="sourceC" name="components/sensor/tsl2561/fsl_tsl2561.c" projectpath="tsl"/>
        <file category="include" name="components/sensor/tsl2561/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="utick" Cversion="2.0.5" condition="driver.utick.condition_id">
      <description>UTICK Driver</description>
      <files>
        <file category="header" name="devices/LPC5536/drivers/fsl_utick.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC5536/drivers/fsl_utick.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC5536/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="video-common" Cversion="1.1.0" condition="driver.video-common.condition_id">
      <description>Driver video-common</description>
      <files>
        <file category="header" name="components/video/fsl_video_common.h" projectpath="video"/>
        <file category="sourceC" name="components/video/fsl_video_common.c" projectpath="video"/>
        <file category="include" name="components/video/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="video-i2c" Cversion="1.0.1" condition="driver.video-i2c.condition_id">
      <description>Driver video-i2c</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/video/i2c/fsl_video_i2c.h" projectpath="video"/>
        <file category="sourceC" name="components/video/i2c/fsl_video_i2c.c" projectpath="video"/>
        <file category="include" name="components/video/i2c/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="vref" Cversion="2.4.0" condition="driver.vref_1.condition_id">
      <description>VREF Driver</description>
      <files>
        <file category="header" name="devices/LPC5536/drivers/fsl_vref.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC5536/drivers/fsl_vref.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC5536/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524" Cversion="2.1.1" condition="driver.wm8524.condition_id">
      <description>Driver wm8524</description>
      <RTE_Components_h>
#ifndef CODEC_WM8524_ENABLE
#define CODEC_WM8524_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/wm8524/fsl_wm8524.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/wm8524/fsl_wm8524.c" projectpath="codec"/>
        <file category="include" name="components/codec/wm8524/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904" Cversion="2.5.1" condition="driver.wm8904.condition_id">
      <description>Driver wm8904</description>
      <RTE_Components_h>
#ifndef CODEC_WM8904_ENABLE
#define CODEC_WM8904_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/wm8904/fsl_wm8904.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/wm8904/fsl_wm8904.c" projectpath="codec"/>
        <file category="include" name="components/codec/wm8904/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960" Cversion="2.2.4" condition="driver.wm8960.condition_id">
      <description>Driver wm8960</description>
      <RTE_Components_h>
#ifndef CODEC_WM8960_ENABLE
#define CODEC_WM8960_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/wm8960/fsl_wm8960.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/wm8960/fsl_wm8960.c" projectpath="codec"/>
        <file category="include" name="components/codec/wm8960/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962" Cversion="2.2.0" condition="driver.wm8962.condition_id">
      <description>Driver wm8962</description>
      <RTE_Components_h>
#ifndef CODEC_WM8962_ENABLE
#define CODEC_WM8962_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/wm8962/fsl_wm8962.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/wm8962/fsl_wm8962.c" projectpath="codec"/>
        <file category="include" name="components/codec/wm8962/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wwdt" Cversion="2.1.10" condition="driver.wwdt.condition_id">
      <description>WWDT Driver</description>
      <files>
        <file category="header" name="devices/LPC5536/drivers/fsl_wwdt.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC5536/drivers/fsl_wwdt.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC5536/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="baremetal" Cversion="1.0.0" condition="middleware.baremetal.condition_id">
      <description>Middleware baremetal</description>
      <RTE_Components_h>
#ifndef SDK_OS_BAREMETAL
#define SDK_OS_BAREMETAL 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="middleware/bm/middleware.baremetal_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="misc_utilities" Cversion="1.1.1" condition="utilities.misc_utilities.condition_id">
      <description>
        Utilities which is needed for particular toolchain like the SBRK function required to address limitation between HEAP and STACK in GCC toolchain library.
      </description>
      <files>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/LPC5536/utilities/fsl_syscall_stub.c" projectpath="utilities"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/LPC5536/utilities/fsl_sbrk.c" projectpath="utilities"/>
        <file condition="allOf.toolchains=armgcc, mdk, cores=cm33.condition_id" category="sourceAsm" name="devices/LPC5536/utilities/fsl_memcpy.S" projectpath="utilities"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="unity" Cversion="2.1.0" condition="utilities.unity.condition_id">
      <description>Simple Unit Testing for C</description>
      <RTE_Components_h>
#ifndef UNITY_CUSTOM_OUTPUT_CHAR
#define UNITY_CUSTOM_OUTPUT_CHAR 
#endif
</RTE_Components_h>
      <files>
        <file category="sourceC" name="devices/LPC5536/utilities/unity/unity.c" projectpath="utilities/unity"/>
        <file category="header" name="devices/LPC5536/utilities/unity/unity.h" projectpath="utilities/unity"/>
        <file category="header" name="devices/LPC5536/utilities/unity/unity_internals.h" projectpath="utilities/unity"/>
        <file category="include" name="devices/LPC5536/utilities/unity/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert" Cversion="1.0.0" condition="utility.assert.condition_id">
      <description>Utility assert</description>
      <files>
        <file category="header" name="devices/LPC5536/utilities/debug_console/fsl_assert.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/LPC5536/utilities/debug_console/fsl_assert.c" projectpath="utilities"/>
        <file category="include" name="devices/LPC5536/utilities/debug_console/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite" Cversion="1.0.0" condition="utility.assert_lite.condition_id">
      <description>Utility assert_lite</description>
      <files>
        <file category="header" name="devices/LPC5536/utilities/debug_console_lite/fsl_assert.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/LPC5536/utilities/debug_console_lite/fsl_assert.c" projectpath="utilities"/>
        <file category="include" name="devices/LPC5536/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console" Cversion="1.0.1" condition="utility.debug_console.condition_id">
      <description>Utility debug_console</description>
      <files>
        <file category="header" name="devices/LPC5536/utilities/debug_console/fsl_debug_console.h" projectpath="utilities/debug_console"/>
        <file category="sourceC" name="devices/LPC5536/utilities/debug_console/fsl_debug_console.c" projectpath="utilities/debug_console"/>
        <file category="include" name="devices/LPC5536/utilities/debug_console/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite" Cversion="1.0.0" condition="utility.debug_console_lite.condition_id">
      <description>Utility debug_console_lite</description>
      <files>
        <file category="header" name="devices/LPC5536/utilities/debug_console_lite/fsl_debug_console.h" projectpath="utilities/debug_console_lite"/>
        <file category="sourceC" name="devices/LPC5536/utilities/debug_console_lite/fsl_debug_console.c" projectpath="utilities/debug_console_lite"/>
        <file category="include" name="devices/LPC5536/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug console template config" Cversion="1.0.0" condition="utility.debug_console_template_config.condition_id">
      <description>Utility debug_console Template Config</description>
      <files>
        <file category="header" attr="config" name="devices/LPC5536/utilities/debug_console/config/fsl_debug_console_conf.h" version="1.0.0" projectpath="utilities/debug_console/config"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="incbin" Cversion="1.0.0" condition="utility.incbin.condition_id">
      <description>Used to include slave core binary into master core binary.</description>
      <files>
        <file condition="allOf.toolchains=armgcc, mdk.condition_id" category="sourceAsm" name="devices/LPC5536/utilities/incbin/fsl_incbin.S" projectpath="utilities"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="notifier" Cversion="1.0.0" condition="utility.notifier.condition_id">
      <description>Utility notifier</description>
      <files>
        <file category="sourceC" name="devices/LPC5536/utilities/fsl_notifier.c" projectpath="utilities/utilities"/>
        <file category="header" name="devices/LPC5536/utilities/fsl_notifier.h" projectpath="utilities/utilities"/>
        <file category="include" name="devices/LPC5536/utilities/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="shell" Cversion="1.0.0" condition="utility.shell.condition_id">
      <description>Utility shell</description>
      <files>
        <file category="header" name="devices/LPC5536/utilities/shell/fsl_shell.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/LPC5536/utilities/shell/fsl_shell.c" projectpath="utilities"/>
        <file category="include" name="devices/LPC5536/utilities/shell/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="str" Cversion="1.0.0" condition="utility.str.condition_id">
      <description>Utility str</description>
      <files>
        <file category="header" name="devices/LPC5536/utilities/str/fsl_str.h" projectpath="utilities/str"/>
        <file category="sourceC" name="devices/LPC5536/utilities/str/fsl_str.c" projectpath="utilities/str"/>
        <file category="include" name="devices/LPC5536/utilities/str/"/>
      </files>
    </component>
  </components>
</package>